In [1]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})

df

  key1 key2     data1     data2
0    a  one  0.417470  2.318469
1    a  two -1.388925  1.907067
2    b  one -0.469006  0.621225
3    b  two  0.629376  2.643144
4    a  one  0.186927  0.248554

In [2]:
grouped = df.groupby(by=["台北",'台北','台北','台中','台中'])[['data1','data2']]
grouped.min()

       data1     data2
台中  0.186927  0.248554
台北 -1.388925  0.621225